/*****************************************************************//**
 * \file   AssimpConversion.h
 * \brief  Assimpで読み込んだデータを.mdにコンバートするクラス
 * 
 * \author Hiroto Kuge
 * \date   March 2023
 *********************************************************************/

#pragma once

#define NOMINMAX
#include <d3d12.h>
#include <DirectXMath.h>
#include <string>
#include <vector>

#include <assimp/scene.h>
#include <assimp/Importer.hpp>
#include <assimp/postprocess.h>



//=============================================================================
// MD_Material 
//=============================================================================
struct MD_Material{
	std::string AlbedMapFileName = "";		// ディフューズマップファイルパス
	std::string MetalnessMapFileName = "";	// メタルネスマップファイルパス
	std::string RoughnessMapFileName = "";	// ラフネスマップファイルパス
	std::string NormalMapFileName = "";		// 法線マップファイルパス
	std::string HeightMapFileName = "";		// ハイトマップパス	
};

//=============================================================================
// LoadSettings：Assimpでモデルデータを読み込む際の設定
//=============================================================================
struct ComvertSettings {
	std::string loadFilePath = nullptr; // ファイルパス
	std::string exportFileName = nullptr; // 出力するファイル名
	bool inverseU = false; // U座標を反転させるか
    bool inverseV = false; // V座標を反転させるか
	bool useExpandMaterial = false;			// ユーザー定義のマテリアルを使うかどうか
	MD_Material* pExpandMaterial = nullptr;	// ユーザー定義のマテリアル
};

//=============================================================================
// AssimpConversion Class
//=============================================================================
class AssimpConversion {
	//-----------------------------------------------------------------------------
	// list of friends classes and methods.
	//-----------------------------------------------------------------------------	
	//!{
			/* Nothing */
	//!} 
public:
	//-----------------------------------------------------------------------------
	// public variables.
	//-----------------------------------------------------------------------------
	//!{
			/* Nothing */
	//!} 
	//-----------------------------------------------------------------------------
	// public methods.
	//-----------------------------------------------------------------------------
	//!{
    /*****************************************************************//**
     * \brief .mdファイルにコンバートする
     * 
     * \param setting 設定
     *********************************************************************/
    void ComvertToMD(ComvertSettings& setting);

	//!} 
private:
	//-----------------------------------------------------------------------------
	// private variables.
	//-----------------------------------------------------------------------------
	//!{
	//!}
	//-----------------------------------------------------------------------------
	// private methods.
	//----------------------------------------------------------------------------- 
	//!{
   
	/*****************************************************************//**
	 * \brief Assimpのマテリアルを解析
	 * 
	 * \param dst			 解析データの格納先
	 * \param assimpMaterial Assimpマテリアルデータ
	 *********************************************************************/
	void ParseMaterial(MD_Material& dst, aiMaterial& assimpMaterial);
	
	
	//!} 
};
